import { createApp } from 'vue'
import App from './App.vue'
import './main.css'

createApp(App).mount('#app')


// Сделать:
//
// [x] Проверку на существующие тикеры, если существуют вывести сообщение. 
// [x] При изменении поля ввода сообщение исчезает.
// [x] При вводе добавить автозаполнение существующими валютами полученными по API.
// [x] Проверка на существующий тикер при автозаполнении
// [x] Показать спиннер пока страница/данные грузятся, убрать когда загрузилась

// дз 2
// Выписать критерии оценки проблем с кодом.